---
kind: type
id: T:Autodesk.Revit.DB.PointCloudColorMode
source: html/12e4d06d-3d5f-53d6-7be9-97bed63ec47b.htm
---
# Autodesk.Revit.DB.PointCloudColorMode

Color mode of a point cloud or part of a point cloud

## Syntax (C#)
```csharp
public enum PointCloudColorMode
```